test/fields/cases/localPatchTypes/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Unit cube, 2 x 2 x 2 uniform cells. Every patch is axis-aligned, so its face
// normals are exactly the axis unit vectors the expectations in
// test_neon_local_patch_types.py are written against.

scale   1;

vertices
(
    (0 0 0)
    (1 0 0)
    (1 1 0)
    (0 1 0)
    (0 0 1)
    (1 0 1)
    (1 1 1)
    (0 1 1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (2 2 2) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    xMin { type patch; faces ( (0 4 7 3) ); }
    xMax { type patch; faces ( (1 2 6 5) ); }
    yMin { type patch; faces ( (0 1 5 4) ); }
    yMax { type wall;  faces ( (3 7 6 2) ); }
    zMin { type wall;  faces ( (0 3 2 1) ); }
    zMax { type wall;  faces ( (4 5 6 7) ); }
);

mergePatchPairs
(
);


// ************************************************************************* //
